BUY_USDT = '🟢Купить USDT'

SELL_USDT = '🔴Продать USDT'

WELCOME_TEXT = '''<b>Здравствуйте</b>🤝

<i>Добро пожаловать в наш сервис обмена</i>

(RUB ↔️ USDT💲)✅

<b>( работаем только с банками РФ 🇷🇺)</b>

<b>выберите необходимое действие</b>👇'''

TERMS_SELL = '''<b>Алгоритм продажи USDT</b>💲 :
<i>( минимально от 100 USDT )</i>

1. Вы отправляете USDT💲 на предоставленный адрес в сети BEP20  

❗️️предоставляете скрин превода✅

2. Затем мы отправляем вам рубли на предоставленные вами реквизиты по номеру телефона через СБП на нужный вам банк❗️


‼️В случае несоблюдения условий, правил и ошибок при переводе, средства будут утеряны‼️
<b>БУДЬТЕ ВНИМАТЕЛЬНЫ</b> ❗️'''

TERMS_BUY = '''<b>Алгоритм покупки USDT</b>💲:
<i>( минимально от 50usdt )</i>

1. Вы отправляете рубли на предоставленные банковские реквизиты, без каких либо комментариев к платежу и на верный банк получателя‼️который указан в реквизитах, предоставляете чек перевода✅
2. Затем мы отправляем USDT💲 на предоставленный вами адрес USDT в сети BEP20 ✅


‼️В случае несоблюдения условий, правил и ошибок при переводе, средства будут утеряны‼️
<b>БУДЬТЕ ВНИМАТЕЛЬНЫ</b> ❗️'''



CONFIRM_FOR_USER = "Ваш запрос принят в работу. Наш специалист свяжется с вами в ближайшее время."

CANCEL = 'Отмена'

CONFIRM = 'Подтверждаю'

CHOOSE_BUY = '''Напишите цифрами👇
Какую сумму в USDT хотите купить:'''

CHOOSE_BUY_AGAIN = '''Пожалуйста, используйте для ввода <b>только цифры</b>
Напишите цифрами👇
Какую сумму в USDT хотите купить:'''

CHOOSE_BUY_MORE = '''Мы продаем от <b>50</b> USDT
Напишите цифрами👇
Какую сумму в USDT хотите купить?'''

CHOOSE_SELL = '''Напишите цифрами👇
Какую сумму в USDT хотите продать?'''

CHOOSE_SELL_AGAIN = '''Пожалуйста, используйте для ввода <b>только цифры</b>
Напишите цифрами👇
Какую сумму в USDT хотите продать?'''

CHOOSE_SELL_MORE = '''Мы покупаем от <b>100</b> USDT
Напишите цифрами👇
Какую сумму в USDT хотите продать?'''

LEXICON_COMMON_MENU = {
    '/start': 'Начать все заново',
    '/help': 'Справка по работе бота',
    '/cancel': 'Отменить действие',
}

HELP = 'здесь будет help'