BUY_USDT = '🟢Купить USDT'

SELL_USDT = '🔴Продать USDT'

WELCOME_TEXT = '''<b>Здравствуйте</b>🤝

<i>Добро пожаловать в наш сервис обмена</i>

(RUB ↔️ USDT💲)✅

<b>(Работаем только с банками РФ 🇷🇺)</b>

<b>выберите необходимое действие</b>👇'''

TERMS_SELL = '''<b>Алгоритм продажи USDT</b>💲 :
<i>( минимально от 100 USDT )</i>

1. Вы отправляете USDT💲 на предоставленный адрес в сети BEP20. 
2. Предоставляете скрин перевода ✅
3. Затем, мы отправляем вам рубли, на предоставленные вами реквизиты по номеру телефона, через СБП на нужный вам банк ✅


‼️<b>В случае несоблюдения условий, правил и ошибок при переводе, средства будут утеряны</b>‼️

❗️<b>БУДЬТЕ ВНИМАТЕЛЬНЫ</b> ❗️
'''

TERMS_BUY = '''<b>Алгоритм покупки USDT</b>💲:
<i>( минимально от 100 USDT )</i>

1. Вы отправляете рубли на предоставленные банковские реквизиты, без каких либо комментариев к платежу, на банк получателя который указан в реквизитах ‼️ 
2. Предоставляете чек перевода✅
3. Затем, мы отправляем USDT💲 на предоставленный вами адрес в сети BEP20 ✅


‼️<b>В случае несоблюдения условий, правил и ошибок при переводе, средства будут утеряны</b>‼️

❗️<b>БУДЬТЕ ВНИМАТЕЛЬНЫ</b> ❗️
'''

CANCEL = 'Отмена'

CONFIRM = 'Подтверждаю'

CHOOSE_BUY = '''Перейдите в аккаунт 👉 @zion_pay_rub
Напишите цифрами сумму в USDT, которую хотите купить'''



CHOOSE_SELL = '''Перейдите в аккаунт 👉 @zion_pay_usdt
Напишите цифрами сумму в USDT, которую хотите продать'''


LEXICON_COMMON_MENU = {
    '/start': 'Начать все заново',
    '/help': 'Справка по работе бота',
    '/cancel': 'Отменить действие',
}

HELP =  '''По всем вопросам писать в аккаунт @zion_pay_rub'''